#1 Написать программу для получения списка словарей из списков.

color_name = ["Black", "Red", "Maroon", "Yellow"]
color_code = ["#000000", "#FF0000", "#800000", "#FFFF00"]
colours = dict(zip(color_name, color_code))
print(colours)



